---
kind: type
id: T:Autodesk.Revit.DB.CeilingAndFloor
source: html/2132815c-5748-a477-a626-fc29139d3518.htm
---
# Autodesk.Revit.DB.CeilingAndFloor

A base class that provides support for all ceiling and floor objects.

## Syntax (C#)
```csharp
public class CeilingAndFloor : HostObject
```